In [1]:
import pandas as pd
import numpy as np

In [2]:
a=pd.Series([3,4,7,9])
a

0    3
1    4
2    7
3    9
dtype: int64

In [3]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
aa=pd.Series([3,2,1,5,4],index=['one','two','three','four',0])
aa

one      3
two      2
three    1
four     5
0        4
dtype: int64

In [5]:
aa.index

Index(['one', 'two', 'three', 'four', 0], dtype='object')

In [6]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
a+aa

0        7.0
1        NaN
2        NaN
3        NaN
four     NaN
one      NaN
three    NaN
two      NaN
dtype: float64

In [8]:
c=pd.Series(range(2,10))
c

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int64

In [9]:
c[2:5]

2    4
3    5
4    6
dtype: int64

In [10]:
c

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int64

In [11]:
d=pd.Series(range(2,10),index=['one','two','three','four','five','six','seven','eight'])
d

one      2
two      3
three    4
four     5
five     6
six      7
seven    8
eight    9
dtype: int64

In [12]:
d['two':'five']

two      3
three    4
four     5
five     6
dtype: int64

In [13]:
d['two':'five']=3

In [14]:
d

one      2
two      3
three    3
four     3
five     3
six      7
seven    8
eight    9
dtype: int64

In [15]:
def mul(marks):
    return marks*100

In [16]:
d.apply(mul)

one      200
two      300
three    300
four     300
five     300
six      700
seven    800
eight    900
dtype: int64

In [17]:
d.apply(lambda x:x/100)

one      0.02
two      0.03
three    0.03
four     0.03
five     0.03
six      0.07
seven    0.08
eight    0.09
dtype: float64

In [18]:
def result(num):
    if num>50:
        pass
    else:
        print('fail')

In [19]:
result(4)

fail

In [20]:
a

0    3
1    4
2    7
3    9
dtype: int64

In [21]:
a.apply(lambda x:'ok' if(x>=7) else 'no')

0    no
1    no
2    ok
3    ok
dtype: object

In [22]:
aa

one      3
two      2
three    1
four     5
0        4
dtype: int64

In [25]:
a.index=aa.index

ValueError: Length mismatch: Expected axis has 4 elements, new values have 5 elements

In [26]:
aaa=pd.Series([2,6,8,4],index=['one','two','three','four','five'])
aaa

ValueError: Length of values (4) does not match length of index (5)

In [27]:
aaa=pd.Series([2,6,8,4,7],index=['one','two','three','four','five'])
aaa

one      2
two      6
three    8
four     4
five     7
dtype: int64

In [28]:
aaa=pd.Series(199,index=['one','two','three','four','five'])
aaa

one      199
two      199
three    199
four     199
five     199
dtype: int64

In [29]:
aaa

one      199
two      199
three    199
four     199
five     199
dtype: int64

In [30]:
np.linspace(1,5,3)

array([1., 3., 5.])

In [31]:
a=pd.Series({1:'Talha','b':33})
a

1    Talha
b       33
dtype: object

In [32]:
a.values

array(['Talha', 33], dtype=object)

In [33]:
a.index

Index([1, 'b'], dtype='object')

In [34]:
a=pd.Series([2,4,7,9,3,np.nan,4,np.nan])
a

0    2.0
1    4.0
2    7.0
3    9.0
4    3.0
5    NaN
6    4.0
7    NaN
dtype: float64

In [35]:
len(a)

8

In [36]:
a.size

8

In [37]:
a.count() #count valid values in the series

6

In [38]:
a.shape

(8,)

In [39]:
a.unique()

array([ 2.,  4.,  7.,  9.,  3., nan])

In [40]:
a.value_counts()

4.0    2
2.0    1
7.0    1
9.0    1
3.0    1
dtype: int64

In [41]:
a.head()

0    2.0
1    4.0
2    7.0
3    9.0
4    3.0
dtype: float64

In [42]:
a.tail()

3    9.0
4    3.0
5    NaN
6    4.0
7    NaN
dtype: float64

In [43]:
a.head(2)

0    2.0
1    4.0
dtype: float64

In [44]:
a.tail(3)

5    NaN
6    4.0
7    NaN
dtype: float64

In [45]:
a

0    2.0
1    4.0
2    7.0
3    9.0
4    3.0
5    NaN
6    4.0
7    NaN
dtype: float64

In [46]:
a[[1,3,4]]

1    4.0
3    9.0
4    3.0
dtype: float64

In [47]:
a.index=['one','two','three','four','five','six','seven','eight']
a

one      2.0
two      4.0
three    7.0
four     9.0
five     3.0
six      NaN
seven    4.0
eight    NaN
dtype: float64

In [48]:
a[['one','six']]

one    2.0
six    NaN
dtype: float64

In [49]:
random.seed(3)
def randosm():
    for i in range(2):
        print(random.randint(3,6))
        print(random.randint(2,4))

NameError: name 'random' is not defined

In [50]:
randosm()

NameError: name 'randosm' is not defined

In [51]:
a

one      2.0
two      4.0
three    7.0
four     9.0
five     3.0
six      NaN
seven    4.0
eight    NaN
dtype: float64

In [52]:
c

0    2
1    3
2    4
3    5
4    6
5    7
6    8
7    9
dtype: int64

In [53]:
combined=pd.concat([a,c])
combined

one      2.0
two      4.0
three    7.0
four     9.0
five     3.0
six      NaN
seven    4.0
eight    NaN
0        2.0
1        3.0
2        4.0
3        5.0
4        6.0
5        7.0
6        8.0
7        9.0
dtype: float64

In [54]:
combined.reset_index(drop=True,inplace=True)

In [55]:
combined

0     2.0
1     4.0
2     7.0
3     9.0
4     3.0
5     NaN
6     4.0
7     NaN
8     2.0
9     3.0
10    4.0
11    5.0
12    6.0
13    7.0
14    8.0
15    9.0
dtype: float64

In [56]:
combined[8]=9999

In [57]:
combined

0        2.0
1        4.0
2        7.0
3        9.0
4        3.0
5        NaN
6        4.0
7        NaN
8     9999.0
9        3.0
10       4.0
11       5.0
12       6.0
13       7.0
14       8.0
15       9.0
dtype: float64

In [58]:
del combined[7]

In [59]:
combined

0        2.0
1        4.0
2        7.0
3        9.0
4        3.0
5        NaN
6        4.0
8     9999.0
9        3.0
10       4.0
11       5.0
12       6.0
13       7.0
14       8.0
15       9.0
dtype: float64

In [60]:
combined[10:13]=1444

In [61]:
combined

0        2.0
1        4.0
2        7.0
3        9.0
4        3.0
5        NaN
6        4.0
8     9999.0
9        3.0
10       4.0
11    1444.0
12    1444.0
13    1444.0
14       8.0
15       9.0
dtype: float64

In [62]:
a

one      2.0
two      4.0
three    7.0
four     9.0
five     3.0
six      NaN
seven    4.0
eight    NaN
dtype: float64

In [63]:
b=a

In [64]:
b

one      2.0
two      4.0
three    7.0
four     9.0
five     3.0
six      NaN
seven    4.0
eight    NaN
dtype: float64

In [65]:
b['three':'six']=3434

In [66]:
b

one         2.0
two         4.0
three    3434.0
four     3434.0
five     3434.0
six      3434.0
seven       4.0
eight       NaN
dtype: float64

In [67]:
a

one         2.0
two         4.0
three    3434.0
four     3434.0
five     3434.0
six      3434.0
seven       4.0
eight       NaN
dtype: float64

In [68]:
c=a.copy()

In [69]:
a

one         2.0
two         4.0
three    3434.0
four     3434.0
five     3434.0
six      3434.0
seven       4.0
eight       NaN
dtype: float64

In [70]:
c

one         2.0
two         4.0
three    3434.0
four     3434.0
five     3434.0
six      3434.0
seven       4.0
eight       NaN
dtype: float64

In [71]:
c['six']=444444

In [72]:
c

one           2.0
two           4.0
three      3434.0
four       3434.0
five       3434.0
six      444444.0
seven         4.0
eight         NaN
dtype: float64

In [73]:
a

one         2.0
two         4.0
three    3434.0
four     3434.0
five     3434.0
six      3434.0
seven       4.0
eight       NaN
dtype: float64

In [74]:
stud={'Name':['Talha','Ali','Umer','Usman'],'Roll':[2,3,6,8],'Cources':['Python','C','Java','GO']}
studdet=pd.DataFrame(stud)
studdet['Mode']=['Online','Onsite','Onsite','Online']
display(studdet)

    Name  Roll Cources    Mode
0  Talha     2  Python  Online
1    Ali     3       C  Onsite
2   Umer     6    Java  Onsite
3  Usman     8      GO  Online

In [75]:
display(type(studdet['Name']))
display(type(studdet[['Name','Cources']]))
display(type(studdet[['Name']]))

pandas.core.series.Series

pandas.core.frame.DataFrame

pandas.core.frame.DataFrame

In [76]:
aaa=np.array([[[4]]])
aaa.ndim

3

In [77]:
# lis=np.array([[2,4,6],[3,4,5],[2,34,5]])
# pd.DataFrame(lis,index=[1,2,3],columns=['a','b','c'])
# lis=[2,4,7]
# pd.DataFrame([lis],index=[1,2,3],columns=['a','b','c'])
# lis=[[2,4,7]]
# pd.DataFrame(lis,index=[1,2,3],columns=['a','b','c'])
# ls=[2,5,6]
# display(pd.DataFrame(ls,index=[2,3,4],columns=['s']))
# ls=[1,5,7]
# display(pd.DataFrame([ls],index=[2,3,4],columns=['s','r','t']))
# lis=[[2,4,7],[3,6,8],[2,1,1]]
# pd.DataFrame(lis,index=[1,2,3],columns=['a','b','c'])
lis=[2,4,7],[3,6,8],[2,1,1]
pd.DataFrame(lis,index=[1,2,3],columns=['a','b','c'])

   a  b  c
1  2  4  7
2  3  6  8
3  2  1  1

In [78]:
#Accessing data
#Coloumn
display(studdet['Cources'])
display(studdet[['Name','Cources']])
display(studdet)

0    Python
1         C
2      Java
3        GO
Name: Cources, dtype: object

    Name Cources
0  Talha  Python
1    Ali       C
2   Umer    Java
3  Usman      GO

    Name  Roll Cources    Mode
0  Talha     2  Python  Online
1    Ali     3       C  Onsite
2   Umer     6    Java  Onsite
3  Usman     8      GO  Online

In [79]:
studdet['City']=studdet['Mode'].apply(lambda x:'Karachi' if(x=='Onsite') else 'OutsideKhi')
display(studdet)

    Name  Roll Cources    Mode        City
0  Talha     2  Python  Online  OutsideKhi
1    Ali     3       C  Onsite     Karachi
2   Umer     6    Java  Onsite     Karachi
3  Usman     8      GO  Online  OutsideKhi

In [80]:
studdet.index=[1,2,3,4]
display(studdet)

    Name  Roll Cources    Mode        City
1  Talha     2  Python  Online  OutsideKhi
2    Ali     3       C  Onsite     Karachi
3   Umer     6    Java  Onsite     Karachi
4  Usman     8      GO  Online  OutsideKhi

In [81]:
studdet['Ages']=[20,18,22,55]
display(studdet)

    Name  Roll Cources    Mode        City  Ages
1  Talha     2  Python  Online  OutsideKhi    20
2    Ali     3       C  Onsite     Karachi    18
3   Umer     6    Java  Onsite     Karachi    22
4  Usman     8      GO  Online  OutsideKhi    55

In [82]:
studdet['Marks']=[45,58,60,22]
display(studdet)

    Name  Roll Cources    Mode        City  Ages  Marks
1  Talha     2  Python  Online  OutsideKhi    20     45
2    Ali     3       C  Onsite     Karachi    18     58
3   Umer     6    Java  Onsite     Karachi    22     60
4  Usman     8      GO  Online  OutsideKhi    55     22

In [83]:
studdet['Status']=['Pass' if(i>=50) else 'Fail' for i in studdet['Marks']]
studdet

    Name  Roll Cources    Mode        City  Ages  Marks Status
1  Talha     2  Python  Online  OutsideKhi    20     45   Fail
2    Ali     3       C  Onsite     Karachi    18     58   Pass
3   Umer     6    Java  Onsite     Karachi    22     60   Pass
4  Usman     8      GO  Online  OutsideKhi    55     22   Fail

In [84]:
def mature(age):
    if(age<=20):
        return 'Teen Ager'
    elif(age<=40):
        return 'young'
    elif(age<=60):
        return 'Mature'
    else:
        return 'Senior'

In [85]:
studdet['Generation']=studdet['Ages'].apply(mature)
display(studdet)

    Name  Roll Cources    Mode        City  Ages  Marks Status Generation
1  Talha     2  Python  Online  OutsideKhi    20     45   Fail  Teen Ager
2    Ali     3       C  Onsite     Karachi    18     58   Pass  Teen Ager
3   Umer     6    Java  Onsite     Karachi    22     60   Pass      young
4  Usman     8      GO  Online  OutsideKhi    55     22   Fail     Mature

In [86]:
studdet.to_excel('stud.xlsx')

In [87]:
studdet.to_csv('stud.csv')

In [88]:
pd.read_excel('Talha,153,A4.xlsx')

C:\Users\mtalh\anaconda3\lib\site-packages\openpyxl\worksheet\_reader.py:312: UserWarning: Data Validation extension is not supported and will be removed
  warn(msg)

,"Name,Rollnumber,Section","Muhammad Talha,BSCS 153,A4",Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,Daily Wages of Employee,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,S.NO,Names,Daily Wages,Monthly Wages,Income Tax,NaN,days in month:,30.0,tax perc:,0.05
2,1,Talha Joiya,1500,45000,2250,NaN,NaN,NaN,NaN,NaN
3,2,Sufyan,1700,51000,2550,NaN,NaN,NaN,NaN,NaN
4,3,Rehman,2000,60000,3000,NaN,NaN,NaN,NaN,NaN
5,4,Ali,1400,42000,2100,NaN,NaN,NaN,NaN,NaN
6,5,Yousuf,1200,36000,1800,NaN,NaN,NaN,NaN,NaN
7,NaN,Total:,7800,234000,11700,NaN,NaN,NaN,NaN,NaN
8,NaN,Max:,2000,60000,3000,NaN,NaN,NaN,NaN,NaN
9,NaN,Min:,1200,36000,1800,NaN,NaN,NaN,NaN,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,VLOOKUP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,S.N,Names of third and fourth employee,Income tax of third and fourth employee,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,3,Rehman,3000,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,4,Ali,2100,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,NaN,HLOOKUP,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,NaN,Daily wages and Income tax of Sufyan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,Daily Wages,1700,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,Income Tax,2550,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,NaN,HYPERLINK,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,NaN,BACK TO HOME,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27,NaN,MENU DROP DOWN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28,NaN,BSCS,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,DATE AND TIME,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
31,Current Time,23:43:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
32,Current Date,2022-12-09 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
33,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,COUNT,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
35,S.no,5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36,count is only for integer values,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [89]:
dict1={'Talha':21,'Umer':33,'Usman':22,'Ali':18}
studdet['CorrectAges']=studdet.Name.map(dict1)
display(studdet)

,Name,Roll,Cources,Mode,City,Ages,Marks,Status,Generation,CorrectAges
1,Talha,2,Python,Online,OutsideKhi,20,45,Fail,Teen Ager,21
2,Ali,3,C,Onsite,Karachi,18,58,Pass,Teen Ager,18
3,Umer,6,Java,Onsite,Karachi,22,60,Pass,young,33
4,Usman,8,GO,Online,OutsideKhi,55,22,Fail,Mature,22

In [90]:
studdet.to_csv('Updaterecordstud.csv')

In [91]:
pd.read_csv('Updaterecordstud.csv')

,Unnamed: 0,Name,Roll,Cources,Mode,City,Ages,Marks,Status,Generation,CorrectAges
0,1,Talha,2,Python,Online,OutsideKhi,20,45,Fail,Teen Ager,21
1,2,Ali,3,C,Onsite,Karachi,18,58,Pass,Teen Ager,18
2,3,Umer,6,Java,Onsite,Karachi,22,60,Pass,young,33
3,4,Usman,8,GO,Online,OutsideKhi,55,22,Fail,Mature,22